; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-6nodes-1000size-4degree-100mindistance-2trucks-2packages-241seed

(define (problem transport-two-cities-sequential-6nodes-1000size-4degree-100mindistance-2trucks-2packages-241seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 771,106 -> 704,546
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 45)
  ; 704,546 -> 771,106
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 45)
  ; 362,945 -> 704,546
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 53)
  ; 704,546 -> 362,945
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 53)
  ; 718,843 -> 704,546
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 30)
  ; 704,546 -> 718,843
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 30)
  ; 718,843 -> 362,945
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 37)
  ; 362,945 -> 718,843
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 37)
  ; 241,610 -> 704,546
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 47)
  ; 704,546 -> 241,610
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 47)
  ; 241,610 -> 362,945
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 36)
  ; 362,945 -> 241,610
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 36)
  ; 241,610 -> 718,843
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 54)
  ; 718,843 -> 241,610
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 54)
  ; 558,869 -> 704,546
  (road city-1-loc-6 city-1-loc-1)
  (= (road-length city-1-loc-6 city-1-loc-1) 36)
  ; 704,546 -> 558,869
  (road city-1-loc-1 city-1-loc-6)
  (= (road-length city-1-loc-1 city-1-loc-6) 36)
  ; 558,869 -> 362,945
  (road city-1-loc-6 city-1-loc-3)
  (= (road-length city-1-loc-6 city-1-loc-3) 21)
  ; 362,945 -> 558,869
  (road city-1-loc-3 city-1-loc-6)
  (= (road-length city-1-loc-3 city-1-loc-6) 21)
  ; 558,869 -> 718,843
  (road city-1-loc-6 city-1-loc-4)
  (= (road-length city-1-loc-6 city-1-loc-4) 17)
  ; 718,843 -> 558,869
  (road city-1-loc-4 city-1-loc-6)
  (= (road-length city-1-loc-4 city-1-loc-6) 17)
  ; 558,869 -> 241,610
  (road city-1-loc-6 city-1-loc-5)
  (= (road-length city-1-loc-6 city-1-loc-5) 41)
  ; 241,610 -> 558,869
  (road city-1-loc-5 city-1-loc-6)
  (= (road-length city-1-loc-5 city-1-loc-6) 41)
  ; 2987,586 -> 2868,512
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 14)
  ; 2868,512 -> 2987,586
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 14)
  ; 2365,165 -> 2230,548
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 41)
  ; 2230,548 -> 2365,165
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 41)
  ; 2808,55 -> 2868,512
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 47)
  ; 2868,512 -> 2808,55
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 47)
  ; 2808,55 -> 2365,165
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 46)
  ; 2365,165 -> 2808,55
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 46)
  ; 2964,987 -> 2868,512
  (road city-2-loc-6 city-2-loc-1)
  (= (road-length city-2-loc-6 city-2-loc-1) 49)
  ; 2868,512 -> 2964,987
  (road city-2-loc-1 city-2-loc-6)
  (= (road-length city-2-loc-1 city-2-loc-6) 49)
  ; 2964,987 -> 2987,586
  (road city-2-loc-6 city-2-loc-2)
  (= (road-length city-2-loc-6 city-2-loc-2) 41)
  ; 2987,586 -> 2964,987
  (road city-2-loc-2 city-2-loc-6)
  (= (road-length city-2-loc-2 city-2-loc-6) 41)
  ; 771,106 <-> 2230,548
  (road city-1-loc-2 city-2-loc-3)
  (= (road-length city-1-loc-2 city-2-loc-3) 153)
  (road city-2-loc-3 city-1-loc-2)
  (= (road-length city-2-loc-3 city-1-loc-2) 153)
  (at package-1 city-1-loc-5)
  (at package-2 city-1-loc-6)
  (at truck-1 city-2-loc-1)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-6)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-2)
  (at package-2 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-1 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-5)
   goals met: 0 of 2
2. (drive truck-1 city-2-loc-5 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-4)
   goals met: 0 of 2
3. (drive truck-1 city-2-loc-4 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 2
4. (drive truck-1 city-2-loc-3 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 2
5. (drive truck-1 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 2
6. (drive truck-1 city-1-loc-1 city-1-loc-6)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-6)
   goals met: 0 of 2
7. (pick-up truck-1 city-1-loc-6 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-6) (capacity truck-1 capacity-2)
   added: (in package-2 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 2
8. (drive truck-1 city-1-loc-6 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-6)
   added: (at truck-1 city-1-loc-5)
   goals met: 0 of 2
9. (pick-up truck-1 city-1-loc-5 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-5) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 2
10. (drive truck-1 city-1-loc-5 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 2
11. (drive truck-1 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 2
12. (drive truck-1 city-1-loc-2 city-2-loc-3)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 2
13. (drop truck-1 city-2-loc-3 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-0)
   added: (at package-2 city-2-loc-3) (capacity truck-1 capacity-1)
   goals met: 1 of 2
14. (drive truck-1 city-2-loc-3 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-4)
   goals met: 1 of 2
15. (drive truck-1 city-2-loc-4 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-2-loc-5)
   goals met: 1 of 2
16. (drive truck-1 city-2-loc-5 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-1)
   goals met: 1 of 2
17. (drive truck-1 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-2)
   goals met: 1 of 2
18. (drop truck-1 city-2-loc-2 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-1)
   added: (at package-1 city-2-loc-2) (capacity truck-1 capacity-2)
   goals met: 2 of 2
